nxp-mcuxpresso/mcux-soc-svd/MCXA142/MCXA142.xml
          <register>
            <name>TCD_ATTR</name>
            <description>TCD Transfer Attributes</description>
            <addressOffset>0x26</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DSIZE</name>
                <description>Destination Data Transfer Size</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMOD</name>
                <description>Destination Address Modulo</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SSIZE</name>
                <description>Source Data Transfer Size</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EIGHT_BIT</name>
                    <description>8-bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTEEN_BIT</name>
                    <description>16-bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THIRTYTWO_BIT</name>
                    <description>32-bit</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTYFOUR_BIT</name>
                    <description>64-bit</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTEEN_BYTE</name>
                    <description>16-byte</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THIRTYTWO_BYTE</name>
                    <description>32-byte</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SMOD</name>
                <description>Source Address Modulo</description>
                <bitOffset>11</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Source address modulo feature disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Source address modulo feature enabled for any non-zero value [1-31]</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_NBYTES_MLOFFNO</name>
            <description>TCD Transfer Size Without Minor Loop Offsets</description>
            <alternateGroup>MLOFFNO</alternateGroup>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>NBYTES</name>
                <description>Number of Bytes To Transfer Per Service Request</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMLOE</name>
                <description>Destination Minor Loop Offset Enable</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFFSET_NOT_APPLIED</name>
                    <description>Minor loop offset not applied to DADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFFSET_APPLIED</name>
                    <description>Minor loop offset applied to DADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SMLOE</name>
                <description>Source Minor Loop Offset Enable</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFFSET_NOT_APPLIED</name>
                    <description>Minor loop offset not applied to SADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFFSET_APPLIED</name>
                    <description>Minor loop offset applied to SADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_NBYTES_MLOFFYES</name>
            <description>TCD Transfer Size with Minor Loop Offsets</description>
            <alternateGroup>MLOFFYES</alternateGroup>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>NBYTES</name>
                <description>Number of Bytes To Transfer Per Service Request</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MLOFF</name>
                <description>Minor Loop Offset</description>
                <bitOffset>10</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMLOE</name>
                <description>Destination Minor Loop Offset Enable</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFFSET_NOT_APPLIED</name>
                    <description>Minor loop offset not applied to DADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFFSET_APPLIED</name>
                    <description>Minor loop offset applied to DADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SMLOE</name>
                <description>Source Minor Loop Offset Enable</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFFSET_NOT_APPLIED</name>
                    <description>Minor loop offset not applied to SADDR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFFSET_APPLIED</name>
                    <description>Minor loop offset applied to SADDR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_SLAST_SDA</name>
            <description>TCD Last Source Address Adjustment / Store DADDR Address</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>SLAST_SDA</name>
                <description>Last Source Address Adjustment / Store DADDR Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_DADDR</name>
            <description>TCD Destination Address</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DADDR</name>
                <description>Destination Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_DOFF</name>
            <description>TCD Signed Destination Address Offset</description>
            <addressOffset>0x34</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DOFF</name>
                <description>Destination Address Signed Offset</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_CITER_ELINKNO</name>
            <description>TCD Current Major Loop Count (Minor Loop Channel Linking Disabled)</description>
            <alternateGroup>ELINKNO</alternateGroup>
            <addressOffset>0x36</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>CITER</name>
                <description>Current Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>15</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enable Link</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Channel-to-channel linking disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Channel-to-channel linking enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_CITER_ELINKYES</name>
            <description>TCD Current Major Loop Count (Minor Loop Channel Linking Enabled)</description>
            <alternateGroup>ELINKYES</alternateGroup>
            <addressOffset>0x36</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>CITER</name>
                <description>Current Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINKCH</name>
                <description>Minor Loop Link Channel Number</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enable Link</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Channel-to-channel linking disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Channel-to-channel linking enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_DLAST_SGA</name>
            <description>TCD Last Destination Address Adjustment / Scatter Gather Address</description>
            <addressOffset>0x38</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DLAST_SGA</name>
                <description>Last Destination Address Adjustment / Scatter Gather Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_CSR</name>
            <description>TCD Control and Status</description>
            <addressOffset>0x3C</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>START</name>
                <description>Channel Start</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CHANNEL_NOT_STARTED</name>
                    <description>Channel not explicitly started</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHANNEL_STARTED</name>
                    <description>Channel explicitly started via a software-initiated service request</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTMAJOR</name>
                <description>Enable Interrupt If Major count complete</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>End-of-major loop interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>End-of-major loop interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTHALF</name>
                <description>Enable Interrupt If Major Counter Half-complete</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Halfway point interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Halfway point interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DREQ</name>
                <description>Disable Request</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CHANNEL_NOT_AFFECTED</name>
                    <description>No operation</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ERQ_FIELD_CLEAR</name>
                    <description>Clear the ERQ field to 0 upon major loop completion, thus disabling hardware service requests</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ESG</name>
                <description>Enable Scatter/Gather Processing</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL_FORMAT</name>
                    <description>Current channel's TCD is normal format</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SCATTER_GATHER_FORMAT</name>
                    <description>Current channel's TCD specifies scatter/gather format.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MAJORELINK</name>
                <description>Enable Link When Major Loop Complete</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Channel-to-channel linking disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Channel-to-channel linking enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EEOP</name>
                <description>Enable End-Of-Packet Processing</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>End-of-packet operation disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>End-of-packet hardware input signal enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ESDA</name>
                <description>Enable Store Destination Address</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Ability to store destination address to system memory disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Ability to store destination address to system memory enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MAJORLINKCH</name>
                <description>Major Loop Link Channel Number</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BWC</name>
                <description>Bandwidth Control</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_STALL</name>
                    <description>No eDMA engine stalls</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENGINE_STALLS_FOUR</name>
                    <description>eDMA engine stalls for 4 cycles after each R/W</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENGINE_STALLS_EIGHT</name>
                    <description>eDMA engine stalls for 8 cycles after each R/W</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
