nxp-mcuxpresso/mcux-soc-svd/MCXA142/MCXA142.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO0</name>
      <description>GPIO</description>
      <groupName>RGPIO</groupName>
      <headerStructName>RGPIO</headerStructName>
      <baseAddress>0x40102000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x124</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO0</name>
        <value>71</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>feature0</name>
                  <description>Basic implementation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>feature1</name>
                  <description>Protection registers implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQNUM</name>
              <description>Interrupt Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDOR</name>
          <description>Port Data Output</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDO0</name>
              <description>Port Data Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO1</name>
              <description>Port Data Output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO2</name>
              <description>Port Data Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO3</name>
              <description>Port Data Output</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO4</name>
              <description>Port Data Output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO5</name>
              <description>Port Data Output</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO6</name>
              <description>Port Data Output</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO7</name>
              <description>Port Data Output</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO8</name>
              <description>Port Data Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO9</name>
              <description>Port Data Output</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO10</name>
              <description>Port Data Output</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO11</name>
              <description>Port Data Output</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO12</name>
              <description>Port Data Output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO13</name>
              <description>Port Data Output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO14</name>
              <description>Port Data Output</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO15</name>
              <description>Port Data Output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO16</name>
              <description>Port Data Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO17</name>
              <description>Port Data Output</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO18</name>
              <description>Port Data Output</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO19</name>
              <description>Port Data Output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO20</name>
              <description>Port Data Output</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO21</name>
              <description>Port Data Output</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO22</name>
              <description>Port Data Output</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO23</name>
              <description>Port Data Output</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO24</name>
              <description>Port Data Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO25</name>
              <description>Port Data Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO26</name>
              <description>Port Data Output</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO27</name>
              <description>Port Data Output</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO28</name>
              <description>Port Data Output</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdo0</name>
                  <description>Logic level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdo1</name>
                  <description>Logic level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO29</name>
              <description>Port Data Output</description>
              <bitOffset>29</bitOffset>
